Trying a simple way to transform graphviz to mermaid
